[
{
"rewire_id": "sexism2022_english-3906",
"text": "A fleshlight costs $80, doesn't demand more money and will never accuse you of 'sexual assault.' Win/win/win",
"is_sexist": true,
"words_or_signals": ["fleshlight", "demand more money", "accuse you of 'sexual assault'"],
"rationale": "The text contains sexist comments that objectify women and trivialize sexual assault. The comment implies that using a sex toy is preferable to engaging in sexual activity with a woman because a sex toy does not demand more money and will never accuse someone of sexual assault. This view is both sexist and offensive, as it reduces women to mere objects and trivializes the issue of sexual assault. Additionally, it reinforces negative stereotypes about women and undermines their agency."
},
{
"rewire_id": "sexism2022_english-18346",
"text": "What she did is much worse than weinstien because she groomed him since he was 7. weinstien met adult women who wanted a leg up. Big difference.",
"is_sexist": false,
"words_or_signals": ["groomed him since he was 7", "met adult women who wanted a leg up"],
"rationale": "The text does not contain explicitly sexist comments, but it could be interpreted as perpetuating harmful stereotypes. The comment compares two cases of sexual misconduct and suggests that what the woman did was worse than what Weinstein did because she 'groomed' the victim since he was 7. The comment also suggests that Weinstein's victims were adult women who wanted a 'leg up'. These comments could be interpreted as perpetuating harmful stereotypes about women, such as the idea that women are responsible for sexual misconduct, or that adult women who engage in sexual activity with powerful men are complicit in their own victimization. However, the text itself does not contain any explicitly sexist language."
},
{
  "rewire_id": "sexism2022_english-9084",
"text": "Depth of a woman's personality: dogs, Netflix, alcohol, selfies, makeup",
"is_sexist": true,
"words_or_signals": ["depth of a woman's personality", "dogs", "Netflix", "alcohol", "selfies", "makeup"],
"rationale": "The text contains sexist comments. The comment reduces the depth of a woman's personality to superficial and stereotypical interests, such as dogs, Netflix, alcohol, selfies, and makeup. This kind of statement is demeaning and reinforces harmful stereotypes about women. It implies that women are shallow and only interested in frivolous pursuits, which is a damaging and untrue generalization. Therefore, the text is clearly sexist."
},
{
  "rewire_id": "sexism2022_english-15343",
"text": "I really dont get why you are upset, you litterally lost nothing, you didnt even get sex so what was she good for other than that?",
"is_sexist": true,
"words_or_signals": ["you didnt even get sex", "what was she good for other than that"],
"rationale": "The text contains sexist comments. The statement reduces a woman's value to only her sexual availability and usefulness for sex, disregarding her worth as a human being. The comment implies that the woman has no worth or value beyond sex, which is a harmful and untrue generalization. Therefore, the text is clearly sexist."
},
{
  "rewire_id": "sexism2022_english-2392",
"text": "Paul still can not get it. Islam and Feminism are divine spouses. Feminism is not against all men, feminism is against only weak peaceful european men who refused to subjugate women.",
"is_sexist": true,
"words_or_signals": ["Islam and Feminism are divine spouses", "against only weak peaceful european men", "subjugate women"],
"rationale": "The text contains sexist comments. The statement promotes the idea that feminism is not about achieving gender equality for all, but rather, about gaining power for women over certain men. The comment suggests that feminism is against only weak, peaceful European men, which reinforces harmful and untrue stereotypes about men and women. Furthermore, the statement implies that women should be subjugated by men, which is a sexist and unacceptable view. Therefore, the text is clearly sexist."
},
{
"rewire_id": "sexism2022_english-15683",
"text": "But the game isn't the same anymore. We have condoms and birth control so now women can sex with fewer and much less serious consequences as well. It makes sense that they would have more sex with the top guys when there's relatively little to risk.",
"is_sexist": true,
"words_or_signals": ["women can have sex with fewer and less serious consequences", "more sex with the top guys", "little to risk"],
"rationale": "The text is suggesting that women are engaging in sexual activity with 'top guys' solely because of the decreased risk of negative consequences due to birth control and condoms. This statement implies that women are not engaging in sexual activity for their own pleasure, but rather for some sort of strategic gain, perpetuating the harmful stereotype that women are solely motivated by pleasing men. This view is sexist and offensive."
},
{
"rewire_id": "sexism2022_english-6316",
"text": "Check videos. Indian woman can put any male in prison with a simple lie. Some woman did that to a taxi guy to joy pay the bill. She even beat herself. Thanks god, the guy had a camera.",
"is_sexist": true,
"words_or_signals": ["Indian woman can put any male in prison with a simple lie", "Some woman did that to a taxi guy", "She even beat herself"],
"rationale": "The text contains a harmful and offensive stereotype that suggests that Indian women have the power to falsely accuse men of crimes, leading to imprisonment. This is a sexist and unfounded claim. Additionally, the text portrays the woman in the example as manipulative and deceitful, with the implication that her actions were driven by malice or dishonesty. This portrayal of women perpetuates harmful stereotypes and is offensive."
},
{
"rewire_id": "sexism2022_english-17893",
"text": "Because you have other options. They want to feel wanted, until they are needed. There is nothing more boring to a woman than fulfilled expectations.",
"is_sexist": true,
"words_or_signals": ["They want to feel wanted", "until they are needed", "nothing more boring to a woman than fulfilled expectations"],
"rationale": "The text contains sexist comments that suggest that women are not satisfied with fulfilled expectations, and that they only want to be wanted until they are needed. This perpetuates the harmful stereotype that women are not capable of being independent or self-sufficient, and that they require constant validation from men. This view is both sexist and offensive, and diminishes the agency of women."
},
{
"rewire_id": "sexism2022_english-17205",
"text": "More of that toxic masculinity from the product of a single mom.",
"is_sexist": true,
"words_or_signals": ["toxic masculinity", "product of a single mom"],
"rationale": "The text contains sexist comments that use the term 'toxic masculinity' in a derogatory way to imply that men who exhibit certain traits are inherently problematic. The phrase 'product of a single mom' is also problematic, as it suggests that a man's upbringing by a single mother is the root cause of negative behaviors. This view is both sexist and offensive, as it perpetuates harmful stereotypes about men and undermines the agency of single mothers."
},
{
"rewire_id": "sexism2022_english-9238",
"text": "I was watching Quantum Leap on Netflix and noticed that women were always the victims of men and never the other way round. Even if they were a 'bad guy' they were only acting on a mans behalf.",
"is_sexist": true,
"words_or_signals": ["women were always the victims of men", "Even if they were a 'bad guy' they were only acting on a mans behalf"],
"rationale": "The text contains sexist comments that suggest that women are always the victims of men, and that even when women are portrayed as 'bad guys', they are still only acting on behalf of men. This view is both sexist and offensive, as it perpetuates harmful stereotypes about women and undermines their agency. Additionally, the comment implies that the entertainment industry perpetuates these harmful stereotypes, which is a broader issue that should be addressed."
}]

